# JPerGDegreeC Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..JPerGDegreeC Property
SymbolTypeId Class See Also
---
Symbol J/(g·°C), indicating unit Joules per gram degree Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId JPerGDegreeC { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JPerGDegreeC As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JPerGDegreeC {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace